{"body":"\n## Snap Package\n\ndm-tools is a set of applications written in Python and packaged as a strictly\nconfined Snap. Snap packaging provides an easier maintenance workflow than debs\nor rpms, and it works well with the Python ecosystem by bundling\nall application dependencies and removing the requirement for the user\nto manage them. Strictly confined Snaps also have the added benefit of\nproviding the user with assurances that the application is obeying the\nprincipal of least privilege in terms of its use of system resources, and gives\nthe user tools to inspect an application's permissions in the form of its\ninterface and plugs: simply run `snap connections <snap name>`.\n\ndm-tools uses the `home` plug to enable the live-game app to save game state\nbetween sessions, and uses the `network` plug in order to query the open-source\n[D&D 5e SRD API](http://www.dnd5eapi.co/) to automatically populate stats\nfor SRD monsters. That's the extent of the application's permissions on any\nsystem.\n\n## Live-Game\n\nlive-game is an application for tracking combat encounters. Users can add\nand remove combatants on the fly, adjust HP, conditions, and initiative\nrolls, and can use the application to sort combatants by initiative and track\neach turn, often using only single keystrokes.\n\nThe interface of live-game is a curses-like GUI in the terminal that uses\nunicode emojis to display some information. A legend is provided on-screen for\nidentifying the meaning of each emoji.\n\n## Plebs\n\nplebs is an application that generates basic information text for one or more\nNPCs. It can be passed arguments to generate several NPCs at once, and to use\none of several name generator algorithms. The application can also be passed\nan alternate configuration file to adjust the values and probabilities of each\nNPC attribute; documentation on the interface for this config file is\nforthcoming.\n\nIn addition to basic D&D ability scores, plus race and name for each NPC,\nplebs also generates a list of trinkets carried by the NPC (e.g. to help\nmake pickpocketing more interesting), as well as a commoner occupation,\nthree personality traits to help the DM in role-playing the NPC, and a problem\nthat the NPC is having in their life when encountered by the players. NPC\nproblems can work either as minor quests for the players to pursue, or simply\naid the DM in creating flavor and immersion for their game.\n\n## Pockets\n\npockets simply generates a list of one or more interesting trinkets. Although\nsome trinkets are inspired by those in various D&D books, they are all\nultimately of my own creation, and I find myself adding more all the time.\n\n## Open Source\n\ndm-tools is an open source project. Help make it better by submitting issues\nor PRs to [the Github page](https://github.com/codyshepherd/dm-tools).\n","staticData":{}}